{"control": "AC-1", "text": "CivicActions has developed, documented and disseminated to personnel an access control policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Access Control (AC) Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nAccess control policy and procedures are documented in the The Project SSP. Access to Project operational information or system resources is limited to only authorized users, programs or processes. The Department enforces access control policies to protect the integrity of the The Project. This Department reviews and updates this policy as necessary and it has been being updated, as necessary, since April 2008.\n"}
{"control": "CA-1", "text": "CivicActions has developed, documented and disseminated to personnel a certification, accreditation, and security assessment policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Security Assessment and Authorization Policy. This document can be found in the CivicActions Compliance Docs GitHub repository at <https://github.com/CivicActions/compliance-docs>.\n\nProject follows the None. The Project System Security Policy (SSP) provides guidance on all aspects of security for the protection of Project information technology resources.\n\nProject will periodically review and update the SSP when there is a significant change to the regulatory, operational, or technical environment.\n"}
{"control": "PL-1", "text": "The system partially inherits this control from the FedRAMP Provisional ATO granted to the AWS Cloud Service Provider dated 1 May 2013.\n\nCivicActions has developed, documented and disseminated to personnel a system planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and procedures to facilitate the implementation of the policy and associated controls. This information is maintained in the CivicActions Planning (PL) Policy and Procedure document that can be found in the CivicActions GitHub repository at <https://github.com/CivicActions/compliance-docs/>.\n\nThis is Agency common control. More data about implementation can be obtained from the Agency common control catalog.\n\nThe Project developed its security policy planning and procedures based on None, guidance from NIST, the Office of Management and Budget and industry best practices. Security policies and procedures are formally documented within the Project SSP, which provides the roles and responsibilities as it pertains to security planning. It provides guidance on all aspects of security for the protection of Project information technology resources. It defines responsibilities for the implementation and oversight of the guidance contained herein. The plan was last updated in December, 2015.\n"}
{"control": "AU-5", "text": "When notified (e.g., via CloudWatch) of an auditing failure, CivicActions Operations staff will review the causes and take corrective action.\n"}
{"control": "AU-5.a", "text": "In this architecture, AWS CloudTrail is enabled, and provides the basis for audit processing within the infrastructure.\n\nAWS built-in features include customer alerting of AWS CloudTrail and other service failures through the following:\n\n- AWS Service Health Dashboard (http://status.aws.amazon.com)\n- RSS feeds to which the customer organization can subscribe\n- email\n- alerts sent directly to the AWS account *root user* for critical events\n- AWS internal Incident Response and corporate communications processes\n"}
{"control": "AU-6.a", "text": "CivicActions security audit data is collected by the AWS CloudWatch monitoring and observability service to support real time and after-the-fact investigation at the application level for the following:\n\n- Indications of inappropriate or unusual activity\n- Assurance that logging is functioning properly\n- Adherence to logging standards identified in this procedure\n"}
{"control": "AU-6.b", "text": "Any significant findings observed during the inspection are reported to CivicActions' Security Office. If these are considered to constitute a security incident, then the Incident Response process is invoked as described in the implementation of the Incident Response Plan (IR-8).\n"}
{"control": "AU-8", "text": "The Project system clocks are synchronized system-wide and provide time stamps with audit records.\n"}
{"control": "AU-8.a", "text": "AWS includes the Amazon Time Sync Service. Running over Network Time Protocol (NTP), this service synchronizes the time on AWS instances using redundant satellite-connected and atomic clocks in all public AWS regions. The Amazon Time Sync Service provides accurate time stamp data to the following audit methods:\n\n- AWS CloudTrail logging\n- Amazon S3 bucket logging\n- Elastic Load Balancing (ELB) logging\n- Amazon RDS MySQL error logging\n"}
{"control": "AU-8.b", "text": "The Amazon Time Sync Service provides accurate time stamp data to the following audit methods:\n\n- AWS CloudTrail logging\n- Amazon S3 bucket logging\n- Elastic Load Balancing (ELB) logging\n- Amazon RDS MySQL error logging\n\nTime stamps are recorded as specified in the ISO 8601 standard. ISO 8601 represents local time (with the location unspecified), as UTC, or as an offset from UTC.\n"}
{"control": "AC-2", "text": "The system partially inherits this control from the FedRAMP Provisional ATO granted to the AWS Cloud dated 1 May 2013 for the following: AWS account management.\n"}
{"control": "RA-5", "text": "The system partially inherits this control from the FedRAMP Provisional ATO granted to the AWS Cloud dated 1 May 2013 for the following: vulnerability scanning.\n\nThe Project uses vulnerability scanning software to document and determine risks to the system. These scans are run monthly and the results of these scans are being used to inform changes to the system and verify that security controls are working correctly. These scans are used to document the current state of the system, and to analyze security trends as changes are made over time.\n"}
